<?php
defined('ISHOP') or die('Access denied');


// ----------------------------------------------------------------
define('PATH', 'http://ishop/');
// ----------------------------------------------------------------
define('MODEL', 'model/model.php');
// ----------------------------------------------------------------
define('CONTROLLER', 'controller/controller.php');
// ----------------------------------------------------------------
define('VIEW', 'views/');
// ----------------------------------------------------------------
define('TEMPLATE', VIEW.'ishop/');
// ----------------------------------------------------------------
define('HOST', 'localhost');
// ----------------------------------------------------------------
define('USER', 'ishop_user');
// ----------------------------------------------------------------
define('PASS', '123');
// ----------------------------------------------------------------
define('DB', 'ishop');
// ----------------------------------------------------------------
define('TITLE', 'Интернет магазин сотовых телефонов');

$link = mysqli_connect(HOST, USER, PASS, DB) or die('No connection to server');
mysqli_set_charset($link, 'utf8') or die('Could not set charset');